In [28]:
import pandas as pd
import numpy as np

In [29]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4), index=['Row 1', 'Row 2', 'Row 3', 'Row 4', 'Row 5'], columns=["Col 1", "Col 2", "Col 3", "Col 4"])

df

       Col 1  Col 2  Col 3  Col 4
Row 1      0      1      2      3
Row 2      4      5      6      7
Row 3      8      9     10     11
Row 4     12     13     14     15
Row 5     16     17     18     19

In [4]:
df.to_csv('Test.csv')

Accessing the elements

1 - loc
2 - iloc

In [5]:
df.loc['Row 1']

Col 1    0
Col 2    1
Col 3    2
Col 4    3
Name: Row 1, dtype: int32

In [6]:
type(df.loc['Row 1'])

pandas.core.series.Series

In [7]:
df.iloc[:,:] #all rows and columns

       Col 1  Col 2  Col 3  Col 4
Row 1      0      1      2      3
Row 2      4      5      6      7
Row 3      8      9     10     11
Row 4     12     13     14     15
Row 5     16     17     18     19

In [8]:
df.iloc[0:3, 0:2]

       Col 1  Col 2
Row 1      0      1
Row 2      4      5
Row 3      8      9

In [9]:
type(df.iloc[0:3, 0:2])

pandas.core.frame.DataFrame

In [10]:
type(df.iloc[0:2, 0])

pandas.core.series.Series

In [11]:
#convert dataframe to array

df.iloc[:, 1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [12]:
df['Col 1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: Col 1, dtype: int64

In [13]:
df.isnull()

       Col 1  Col 2  Col 3  Col 4
Row 1  False  False  False  False
Row 2  False  False  False  False
Row 3  False  False  False  False
Row 4  False  False  False  False
Row 5  False  False  False  False

In [14]:
df.isnull().sum()

Col 1    0
Col 2    0
Col 3    0
Col 4    0
dtype: int64

In [15]:
df['Col 2'].unique()

array([ 1,  5,  9, 13, 17])

In [16]:
df[['Col 3', 'Col 4']]

       Col 3  Col 4
Row 1      2      3
Row 2      6      7
Row 3     10     11
Row 4     14     15
Row 5     18     19

In [17]:
df = pd.read_csv('mercedes.csv')

In [18]:
df.head()

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
1,6,88.53,k,t,av,e,d,y,l,o,...,1,0,0,0,0,0,0,0,0,0
2,7,76.26,az,w,n,c,d,x,j,x,...,0,0,0,0,0,0,1,0,0,0
3,9,80.62,az,t,n,f,d,x,l,e,...,0,0,0,0,0,0,0,0,0,0
4,13,78.02,az,v,n,f,d,h,d,n,...,0,0,0,0,0,0,0,0,0,0

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4209 entries, 0 to 4208
Columns: 378 entries, ID to X385
dtypes: float64(1), int64(369), object(8)
memory usage: 12.1+ MB

In [20]:
df.describe() # only int an float values are supported

,ID,y,X10,X11,X12,X13,X14,X15,X16,X17,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
count,4209.000000,4209.000000,4209.000000,4209.0,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,...,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000,4209.000000
mean,4205.960798,100.669318,0.013305,0.0,0.075077,0.057971,0.428130,0.000475,0.002613,0.007603,...,0.318841,0.057258,0.314802,0.020670,0.009503,0.008078,0.007603,0.001663,0.000475,0.001426
std,2437.608688,12.679381,0.114590,0.0,0.263547,0.233716,0.494867,0.021796,0.051061,0.086872,...,0.466082,0.232363,0.464492,0.142294,0.097033,0.089524,0.086872,0.040752,0.021796,0.037734
min,0.000000,72.110000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,2095.000000,90.820000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
50%,4220.000000,99.150000,0.000000,0.0,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
75%,6314.000000,109.010000,0.000000,0.0,0.000000,0.000000,1.000000,0.000000,0.000000,0.000000,...,1.000000,0.000000,1.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
max,8417.000000,265.320000,1.000000,0.0,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,...,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000,1.000000

In [21]:
# Get  the unique category counts

df['X0'].value_counts()

z     360
ak    349
y     324
ay    313
t     306
x     300
o     269
f     227
n     195
w     182
j     181
az    175
aj    151
s     106
ap    103
h      75
d      73
al     67
v      36
af     35
m      34
ai     34
e      32
ba     27
at     25
a      21
ax     19
i      18
am     18
aq     18
u      17
l      16
aw     16
ad     14
k      11
b      11
au     11
as     10
r      10
bc      6
ao      4
c       3
aa      2
q       2
ab      1
g       1
ac      1
Name: X0, dtype: int64

In [22]:
df[df['y'] > 100]

,ID,y,X0,X1,X2,X3,X4,X5,X6,X8,...,X375,X376,X377,X378,X379,X380,X382,X383,X384,X385
0,0,130.81,k,v,at,a,d,u,j,o,...,0,0,1,0,0,0,0,0,0,0
6,24,128.76,al,r,e,f,d,f,h,s,...,0,0,0,0,0,0,0,0,0,0
8,27,108.67,w,s,as,e,d,f,i,h,...,1,0,0,0,0,0,0,0,0,0
9,30,126.99,j,b,aq,c,d,f,a,e,...,0,0,1,0,0,0,0,0,0,0
10,31,102.09,h,r,r,f,d,f,h,p,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
4202,8402,123.34,ap,l,s,c,d,aa,d,r,...,0,0,0,0,0,0,0,0,0,0
4204,8405,107.39,ak,s,as,c,d,aa,d,q,...,1,0,0,0,0,0,0,0,0,0
4205,8406,108.77,j,o,t,d,d,aa,h,h,...,0,1,0,0,0,0,0,0,0,0
4206,8412,109.22,ak,v,r,a,d,aa,g,e,...,0,0,1,0,0,0,0,0,0,0
4208,8417,110.85,z,r,ae,c,d,aa,g,w,...,1,0,0,0,0,0,0,0,0,0

CSV

In [30]:
from io import StringIO, BytesIO

In [31]:
data = ('col1, col2, col3\n'
        'x, y, 1\n'
        'a, b, 2\n'
        'c, d, 3')

In [25]:
type(data)

str

In [32]:
pd.read_csv(StringIO(data))

  col1  col2   col3
0    x     y      1
1    a     b      2
2    c     d      3

In [39]:
# Read from specific columns

#df = pd.read_csv(StringIO(data), usecols=['col1', 'col3'])

In [34]:
df

       Col 1  Col 2  Col 3  Col 4
Row 1      0      1      2      3
Row 2      4      5      6      7
Row 3      8      9     10     11
Row 4     12     13     14     15
Row 5     16     17     18     19

In [35]:
data

'col1, col2, col3\nx, y, 1\na, b, 2\nc, d, 3'

In [40]:
df = pd.read_csv(StringIO(data), usecols=lambda x: x.upper() in ['col1', 'col3'])

df

Empty DataFrame
Columns: []
Index: []

In [41]:
info = ('a,b,c,d\n'
        '1,2,3,4\n'
        '5,6,7,8\n'
        '9,10,11')

In [43]:
print(info)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11

In [44]:
df = pd.read_csv(StringIO(info), dtype=object)

In [45]:
df

   a   b   c    d
0  1   2   3    4
1  5   6   7    8
2  9  10  11  NaN

In [48]:
df = pd.read_csv(StringIO(info), dtype={'a' : 'Int64', 'b' : int, 'c' : float})

In [49]:
df

   a   b     c    d
0  1   2   3.0  4.0
1  5   6   7.0  8.0
2  9  10  11.0  NaN

In [50]:
df.dtypes

a      Int64
b      int32
c    float64
d    float64
dtype: object

In [51]:
data = ('index, a, b, c\n'
        '4, apple, bat, 5.7\n'
        '8, orange, cow, 10')

In [52]:
pd.read_csv(StringIO(data), index_col=0) # to make a column, an index

             a     b     c
index
4        apple   bat   5.7
8       orange   cow  10.0

In [53]:
data = ('a, b, c\n'
        '4, apple, bat, \n'
        '8, orange, cow, \n')

In [54]:
pd.read_csv(StringIO(data))

         a     b  c
4    apple   bat
8   orange   cow

In [56]:
pd.read_csv(StringIO(data), index_col=False)

   a        b     c
0  4    apple   bat
1  8   orange   cow

In [57]:
data = ('a,b,c\n'
        '4, apple, bat, \n'
        '8, orange, cow,')

In [58]:
pd.read_csv(StringIO(data), usecols=['b', 'c'], index_col=False)

         b     c
0    apple   bat
1   orange   cow

In [61]:
# Quoting and escape characters.

data = 'a,b\n"hello, \\"Bob\\", nice to see you", 5'

In [62]:
pd.read_csv(StringIO(data), escapechar='\\')

                               a  b
0  hello, "Bob", nice to see you  5

In [63]:
# URL to CSV

df = pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item', sep = '\t')

In [64]:
df

,item_code,item_name,display_level,selectable,sort_sequence
0,AA0,All items - old base,0,T,2
1,AA0R,Purchasing power of the consumer dollar - old ...,0,T,400
2,SA0,All items,0,T,1
3,SA0E,Energy,1,T,375
4,SA0L1,All items less food,1,T,359
...,...,...,...,...,...
395,SSEA011,College textbooks,3,T,314
396,SSEE041,Smartphones,4,T,335
397,SSFV031A,Food at elementary and secondary schools,3,T,122
398,SSGE013,Infants' equipment,3,T,356
399,SSHJ031,Infants' furniture,3,T,165